In [1]:
import pandas as pd

In [2]:
lst=[
    [1,2,3,4],
    [5,6,7],
    [8,9]
    ]

In [3]:
df=pd.DataFrame(lst)

In [4]:
df

   0  1    2    3
0  1  2  3.0  4.0
1  5  6  7.0  NaN
2  8  9  NaN  NaN

In [8]:
# method1
df.columns=['col1','col2','col3','col4']

In [9]:
df

   col1  col2  col3  col4
0     1     2   3.0   4.0
1     5     6   7.0   NaN
2     8     9   NaN   NaN

In [11]:
df.columns.values[1]='mod_col2'

In [12]:
df

   col1  mod_col2  col3  col4
0     1         2   3.0   4.0
1     5         6   7.0   NaN
2     8         9   NaN   NaN

In [13]:
df.index=['row1','row2','row3']

In [14]:
df

      col1  mod_col2  col3  col4
row1     1         2   3.0   4.0
row2     5         6   7.0   NaN
row3     8         9   NaN   NaN

In [16]:
df.index=['row1','mod_row2','row3']

In [17]:
df

          col1  mod_col2  col3  col4
row1         1         2   3.0   4.0
mod_row2     5         6   7.0   NaN
row3         8         9   NaN   NaN

In [20]:
df.rename(columns =lambda x: x+'y')

          col1y  mod_col2y  col3y  col4y
row1          1          2    3.0    4.0
mod_row2      5          6    7.0    NaN
row3          8          9    NaN    NaN

In [21]:
df.rename(index =lambda x: x+'y')

           col1  mod_col2  col3  col4
row1y         1         2   3.0   4.0
mod_row2y     5         6   7.0   NaN
row3y         8         9   NaN   NaN